{"garrulous": ["loquacious; wordy", "Instead of a succinct speech, he was all garrulous."], "recondite": ["abstruse; profound; not understood by many", "recondite fact about the origin of the holiday; Quantum physics is a recondite subject."], "prolific": ["abundantly fruitful; producing a large amount of something", "He is a prolific writer."], "invective": ["abusive", "He is an overbearing, bullying boss who is fond of sending invective e-mails to long-suffering assistants."], "precocious": ["advanced in development", "My nephew is a precocious child."], "assiduous": ["persistant; earnest, steady and energetic; diligent", "She was assiduous in making her company's turnover reach the one billion mark."], "dissemble": ["to hide under a false appearance; pretend; disguise", "He dissembled happiness at the news that his ex-girlfriend was getting married - to someone else."], "profligate": ["dissipated; wasteful; wildly immoral; squandering", "The rich brat wasted his inheritance in profligate living"], "assuage": ["ease or lessen (pain); satisfy (hunger); soothe (anger)", "This painting is of a mother cooing her toddler and assuaging his fear of the dark."], "taciturn": ["habitually silent; talking little;", "Quite contrary to her taciturn nature on our first date, this chatterbox now can't stop talking."], "propinquity": ["nearness in place or time; nearness in blood (kinship)", "Local housing prices, thanks to the propinquity of an especially picturesque beach, are out of the reach of many would-be buyers; propinquity of families."], "compunction": ["remorse", "The habitual offender cheated on the test without compunction."], "intransigence": ["refusal of any compromise; stubbornness", "Intransigence in marriage proposals can result in you being single forever."], "dearth": ["scarcity", "There is dearth of water in this city as if this is a desert."], "surreptitious": ["secret; sneaky; hidden; furtive", "This gadgets surreptitiously pilfer data and serve you with targetted advertisements."], "abeyance": ["(generally used with in) suspension", "Our weekend plans were held in abeyance until we could get the weather forecast."], "sycophant": ["servile flatterer; bootlicker; yes man", "The sycophant said 'yes' to all of the boss's suggestions."], "abate": ["decrease in strength; subside", "The rains will abate by September."], "debacle": ["great disaster; complete failure; sudden downfall", "After the debacle of his first novel, he had trouble getting a publisher for his next book."], "perfidy": ["deceitful breach of faith or betrayal of trust", "The perfidy of Brutus!"], "exigent": ["requiring immediate attention; urgent", "The girls used to start their workday with a flood of exigent matters that required quick decisions."], "disdain": ["view with scorn or contempt", "The activist has an unhealthy disdain for companies that do not heed to the demands of their workers."], "monolithic": ["formed of a single (large) block of stone; massive; immovable; unwavering", "We saw huge monolithic wheels at the Konark Sun Temple."], "veracity": ["truthfulness", "The veracity of the documents could not be verified."], "precarious": ["not stable; uncertain; risky", "Mutual funds are reliable for the average investor as opposed to the precarious stock market."]}