{"garrulous": ["loquacious; wordy", "Instead of a succinct speech, he was all garrulous."], "recondite": ["abstruse; profound; not understood by many", "recondite fact about the origin of the holiday; Quantum physics is a recondite subject."], "prolific": ["abundantly fruitful; producing a large amount of something", "He is a prolific writer."], "invective": ["abusive", "He is an overbearing, bullying boss who is fond of sending invective e-mails to long-suffering assistants."], "precocious": ["advanced in development", "My nephew is a precocious child."], "assiduous": ["persistant; earnest, steady and energetic; diligent", "She was assiduous in making her company's turnover reach the one billion mark."], "dissemble": ["to hide under a false appearance; pretend; disguise", "He dissembled happiness at the news that his ex-girlfriend was getting married - to someone else."], "profligate": ["dissipated; wasteful; wildly immoral; squandering", "The rich brat wasted his inheritance in profligate living"], "assuage": ["ease or lessen (pain); satisfy (hunger); soothe (anger)", "This painting is of a mother cooing her toddler and assuaging his fear of the dark."], "taciturn": ["habitually silent; talking little;", "Quite contrary to her taciturn nature on our first date, this chatterbox now can't stop talking."], "propinquity": ["nearness in place or time; nearness in blood (kinship)", "Local housing prices, thanks to the propinquity of an especially picturesque beach, are out of the reach of many would-be buyers; propinquity of families."], "compunction": ["remorse", "The habitual offender cheated on the test without compunction."], "intransigence": ["refusal of any compromise; stubbornness", "Intransigence in marriage proposals can result in you being single forever."], "dearth": ["scarcity", "There is dearth of water in this city as if this is a desert."], "surreptitious": ["secret; sneaky; hidden; furtive", "This gadgets surreptitiously pilfer data and serve you with targetted advertisements."], "abeyance": ["(generally used with in) suspension", "Our weekend plans were held in abeyance until we could get the weather forecast."], "sycophant": ["servile flatterer; bootlicker; yes man", "The sycophant said 'yes' to all of the boss's suggestions."], "abate": ["decrease in strength; subside", "The rains will abate by September."], "debacle": ["great disaster; complete failure; sudden downfall", "After the debacle of his first novel, he had trouble getting a publisher for his next book."], "perfidy": ["deceitful breach of faith or betrayal of trust", "The perfidy of Brutus!"], "exigent": ["requiring immediate attention; urgent", "The girls used to start their workday with a flood of exigent matters that required quick decisions."], "disdain": ["view with scorn or contempt", "The activist has an unhealthy disdain for companies that do not heed to the demands of their workers."], "monolithic": ["formed of a single (large) block of stone; massive; immovable; unwavering", "We saw huge monolithic wheels at the Konark Sun Temple."], "veracity": ["truthfulness", "The veracity of the documents could not be verified."], "precarious": ["not stable; uncertain; risky", "Mutual funds are reliable for the average investor as opposed to the precarious stock market."], "riveting": ["engrossing, absorbing", "The book he has been reading for the last 36 hours, sure has a riveting story."], "derelict": ["neglected; abandoned", "The mansion was in a derelict state."], "appropriate": ["to take possesion, acquire or use, especially in an illegal or unfair way", "The creditor appropriated my property on being asked for a loan extension."], "exonerate": ["acquit; exculpate; vindicate", "The results of DNA fingerprinting finally exonerated the man, but only after he had wasted 10 years of his life in prison."], "exculpate": ["acquit; exonerate; vindicate", "The evidence present, along with Harvey's compelling argument lead to the exculpation of his client."], "espouse": ["adapt; support", "The new theory has been espoused by many leading physicists."], "truculence": ["tendancy to fight, aggressiveness, belligerence; scathingly harsh; cruelty, savageness, ferocity", "Truculence and violence of die hard fans after the team's loss was a great challenge which the organizers had to face; She is the infamknown for her truculent reviews"], "desultory": ["aimless, haphazard", "I would not like to waste my time in this desultory conversation."], "indignation": ["anger at an injustice", "Selection of substandard papers to be presented at the conference has aroused indignation of academic authors."], "vex": ["annoy; distress", "He was vexed by the headache all morning; The children at the school kept vexing me the entire time I was there."], "propitiate": ["appease; to make someone pleased or less angry by giving or saying something desired", "It is a sacrifice made to propitiate the Godess."], "approbation": ["praise, commendation or approval", "The plan received approbation from the school board."], "felicitous": ["apt; suitably expressed; well chosen", "An essay with mature syntactical development and GRE-level vocabulary deployed felicitously will fetch more points as opposed to an essay with choppy sentences and unsophisticated vocabulary."], "quiescent": ["at rest; dormant; temporarily inactive", "The incident aroused quiescent hatreds between the two communities."], "credulity": ["gullibility; naivete; tendancy to easily believe something and get fooled", "The quack kept selling the phony medicine thriving on credulity of illiterate village elders."], "disparage": ["bellitle; to describe someone as unimportant, weak; degrade", "Voters don't like political advertisements in which opponents disparage each other; The article disparaged polo as a game for the wealthy."], "diatribe": ["bitter scolding; invective speech", "The head of the institution regularly writes diatribes against dowry."], "rancor": ["bitterness; hatred for someone who has treated you unfairly", "The Tibetan rancor for China has lasted decades."], "denigrate": ["defame; bellitle; blacken", "One of the school teachers hated jokes that denigrate women and people identifying to the Sikh religion."], "temerity": ["audacity; boldness; rashness", "The journalist had the temerity to ask the scientist about his divorced wife."], "ramification": ["branching out; subdivision", "Capillaries result from ramification of veins."], "laconic": ["succinct; brief and to the point", "His laconic answers to long questioned fetched him good points on the test."], "terse": ["brief and succinct in a way that may seem unfriendly and rude", "I could tell from her terse replies to my messages that she was in no mood to talk."], "wheedle": ["cajole; coax; pursuade by flattery", "The sycophant wheedled his way into the position but could not stay there for long because of incompetence."], "phlegmatic": ["not easily upset, excited or angered; showing stolid temperamentshowing calmness in a difficult or unpleasant situation", "The response was strangely phlegmatic to what should have been happy news; Dad displayed remarkable phlegm in the time of crisis."], "stoic": ["A person who accepts what happens without complaining or showing emotion", "After waiting six years for permission to immigrate to the U.S., the family is stoic about a six-month postponement."], "equanimity": ["calmness of temperament; composure; right disposition", "Michael Phelps, an olympic swimmer who always displays remarkable equanimity on the platform."], "rescind": ["take back, cancel; to make void", "This summer, the Ruhrtriennale, an international arts festival in the former industrial Ruhr region, rescinded an invitation to a Scottish rap group after pressure mounted surrounding the artists' association with the B.D.S. movement."], "expunge": ["remove; eradicate; cancel", "Time and weather have expunged evidence that a thriving community once existed there."], "idyllic": ["peaceful, happy, enjoyable; charmingly carefree", "My home is an idyllic retreat in the countryside."], "alacrity": ["cheerful promptness; alertness and eagerness", "She received approbation in her new household because of her alacrity in day-to-day activities; You did a good job responding with alacrity in the emergency."], "geniality": ["cheerfulness; kindliness; sympathy", "A genial host; geniality of spirit."], "coda": ["concluding section of a music or literary composition", "The movie's coda shows the protagonist as an adult 25 years later."], "nexus": ["connection", "The ideological nexus connecting Trump, Brexit and Putin is by now easy to spot: nationalism, xenophobia, a vision of Christian \"civilisation\" under threat from Islam, an obsession with sovereignty and going it alone."], "sobriquet": ["a name or phrase that describes the character of someone or something; a nickname", "Her classmates tagged her with the sobriquet \"peanut\" because of her diminutive size."], "conscientious": ["meticulous, careful, extremely thorough maybe because of being governed by dictates of conscience; scrupulous", "He was conscientious in following the doctor's orders."], "belie": ["contradict, prove wrong; give a false impression", "The notion that Mr Xi is stifling innovation is belied by a flourishing of enterprise."], "polemic": ["negative aggresive opinion that stirs up controversy, usually aimed at a particular group; controversial diatribe", "\"Writing jokes is hard\", she said, commenting on talk show polemics."], "disabuse": ["to show or convince someone that a belief is incorrect; correct a false impression", "Let me disabuse you of your foolish notions about married life."], "debauch": ["lead away from virtue, corrupt; seduce from chastity", "The long stay on a tropical isle had debauched the ship's crew to the point where they no longer acted like naval professionals; The criminal was infamous for debauching young women and killing them."], "deference": ["courteous regard for someone's wishes", "They acted in deference to their father's wishes."], "fawning": ["courting favor by flattery, in a servile way", "Coax has something childish in it, wheedle and cajole are knavish and fawn is servile."], "trenchant": ["sharp; effective; cutting; keen", "The writer has a trenchant wit."], "baleful": ["ominous; having a malign influence; deadly", "A dark, baleful sky portending a tornado."], "pernicious": ["causing great harm or damage often in a way that is not easily seen or noticed", "She thinks television has a pernicious influence on our children, and she is right."], "portend": ["to be a sign or warning that something usually bad or unpleasant is going to happen", "If you are superstitious, a black cat portends trouble; Generally, baleful is used as an adjective, pernicious as an adjective as well and portend as a verb."], "rampart": ["tall, thick wall around a castle to protect it from attacks bulwark", "Enemy climbed the fort's rampart."], "gainsay": ["deny", "You can't gainsay proven facts."], "disavow": ["to deny responsibility for; to refuse to acknowledge or accept", "He disavowed the actions of his subordinates; She now seems to be trying to disavow her earlier statements."], "turpitude": ["very evil way of behaving; very evil quality; depravity", "Pictorial advertisements for chic clothing and fragrances in which drug addiction and other forms of moral turpitude are depicted as alternative fashion statements are on the rise."], "dissonance": ["lack of aggrement; discord, opposite of harmony", "There is dissonance between the what we are told and what we see with our eyes."], "fulsome": ["disgustingly excessive", "The player's fulsome praise for the coach showed just how hard he was trying to be named captain of the team."], "recant": ["to take back; retract", "Before arresting Brown, police recanted their initial claim that Bradford was the gunman who shot two people who were wounded."], "repudiate": ["refuse to accept; disown; disavow", "He is known as a knavish businessman. Last year he repudiated a large debt."], "impugn": ["attack as wrong; call into question; challenge", "Being a smart kid, she impugned the motives of her older, otherwise grumpy sister, when she suddenly started acting too nice."], "tractable": ["docile; easily managed", "They are bestowed with a rare blessing of tractable children"], "tenet": ["doctrine; dogma", "\"Diversify\" is one of the bedrock tenets of investing, and it's supposed to shine brightest when markets are turbulent."], "imperious": ["domineering, haughty", "\"You want the smartest kid in the class as your lab partner, but not if they have an imperious attitude and boss you around.\""], "flag": ["droop; grow feeble", "The workers flag in the heat."], "desiccate": ["dry up", "We desiccate fish in the sun; The historian's bland prose desiccates what is actually an exciting period in European history."], "moribund": ["dying", "These three can be found in conjunction with each other - moribund old men, customs and organizations."], "levee": ["earthen or stone embankment to prevent flooding", "Due to the heavy rains, rivers kept spilling over the leeves."], "palliate": ["to make effects of (something, such as an illness) less painful, harmful or harsh", "Aspirin - to palliate pain"], "commensurate": ["equal in extent", "Her new position came with a commensurate level of responsibility."], "substantive": ["having a firm basis in reality and being therefore important, meaningful, or considerable; supported by facts or logic; essential", "There is no substantive reason to change the law."], "distend": ["expand; swell out", "Gases due to overeating distended my belly."], "spurious": ["false; counterfeit; forged; illogical", "The newly built museum had a spurious Picasso painting that wouldn't have fooled an art expert for a second."], "chimerical": ["fantastically improbable; highly unrealistic; imaginitive", "For the time being, interplanetary travel remains a chimerical feature of life in the 21st century."], "beget": ["father, produce, give rise to", "One change in the experimental environment will beget others."], "timorous": ["easily frightened; of a timid disposition", "The braveheart once was a shy and timorous child."], "fecund": ["fruitful in offspring or vegetation; prolific", "The Franklin stove; bifocals; and the lightning rod are just a few of the inventions that we owe to the fecund creativity of Benjamin Franklin."], "adulation": ["excessive or slavish flattery", "The rugby player enjoyed the adulation of his fans."], "squalor": ["filth; degradation; dirty, neglected state", "The family was living in squalor of slums."], "panegyric": ["Formal praise", "She was part of the team that wrote a panegyric on war heroes."], "redoubtable": ["formidable; causing fear or respect; very powerful, impressive", "His next opponent, the reigning champion, would be by far the most redoubtable adversary the young boxer had ever faced."]}